# AnalysisDisplayColorSettings Class

---
Contains color settings for analysis display style element.
SystemObject Autodesk.Revit.DB.AnalysisAnalysisDisplayColorSettings
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class AnalysisDisplayColorSettings : IDisposable

    Public Class AnalysisDisplayColorSettings
    	Implements IDisposable

    public ref class AnalysisDisplayColorSettings : IDisposable

    type AnalysisDisplayColorSettings =
        class
            interface IDisposable
        end
The AnalysisDisplayColorSettings type exposes the following members.
| Name| Description
---|---|---
| AnalysisDisplayColorSettings|  Constructs a default instance of color settings.
| AnalysisDisplayColorSettings(AnalysisDisplayColorSettings)|  Constructs a new copy of the input AnalysisDisplayColorSettings object.
Top
| Name| Description
---|---|---
| ColorSettingsType|  Stores type of color settings
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
| MaxColor|  Color assigned to the maximum value.
| MinColor|  Color assigned to the minimum value.
Top
| Name| Description
---|---|---
| AreIntermediateColorsValid|
| Colors|  Get number of colors, including min, max and intermediate.
| Dispose| Releases all resources used by the AnalysisDisplayColorSettings
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetIntermediateColors|  Get intermediate color entries (other than the minimum and maximum settings).
| GetType| Gets the Type of the current instance.(Inherited from Object)
| IsEqual|  Compares two color settings objects.
| SetIntermediateColors|
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.DB.Analysis Namespace